#+TITLE:Day 1: Sonar Sweep

https://adventofcode.com/2021/day/1

* Problem

Count the number of times a depth measurement increases from the previous measurement. (There is no measurement before the first measurement.) In the example above, the changes are as follows:

#+begin_src text
199 (N/A - no previous measurement)
200 (increased)
208 (increased)
210 (increased)
200 (decreased)
207 (increased)
240 (increased)
269 (increased)
260 (decreased)
263 (increased)
#+end_src

In this example, there are 7 measurements that are larger than the previous measurement.

*How many measurements are larger than the previous measurement?*


* Solutions

** C++

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  using namespace std;

  int increaseCount (const string& filename) {
      int increases = 0;
      ifstream file(filename);

      int previousDepth;
      file >> previousDepth;

      int depth;
      while (file >> depth) {
          cout << previousDepth << "\t" << depth << " ";

          if (depth > previousDepth) {
              ++increases;
              cout << "INCREASE";
          }

          cout << "\n";
          previousDepth = depth;
      }

      return increases;
  }

  int main() {
      cout << increaseCount("example.txt") << "\n";
  }
#+end_src

#+RESULTS:
#+begin_example
100	125 INCREASE
125	124
124	127 INCREASE
127	141 INCREASE
141	145 INCREASE
145	160 INCREASE
160	161 INCREASE
161	178 INCREASE
178	185 INCREASE
185	193 INCREASE
193	196 INCREASE
196	195
195	200 INCREASE
200	212 INCREASE
212	216 INCREASE
216	222 INCREASE
222	244 INCREASE
244	274 INCREASE
274	276 INCREASE
276	279 INCREASE
279	307 INCREASE
307	309 INCREASE
309	325 INCREASE
325	332 INCREASE
332	336 INCREASE
336	338 INCREASE
338	339 INCREASE
339	359 INCREASE
359	378 INCREASE
378	380 INCREASE
380	381 INCREASE
381	386 INCREASE
386	388 INCREASE
388	417 INCREASE
417	418 INCREASE
418	432 INCREASE
432	458 INCREASE
458	459 INCREASE
459	462 INCREASE
462	463 INCREASE
463	467 INCREASE
467	468 INCREASE
468	480 INCREASE
480	482 INCREASE
482	486 INCREASE
486	495 INCREASE
495	510 INCREASE
510	518 INCREASE
518	526 INCREASE
526	528 INCREASE
528	539 INCREASE
539	537
537	536
536	537 INCREASE
537	545 INCREASE
545	564 INCREASE
564	566 INCREASE
566	567 INCREASE
567	571 INCREASE
571	580 INCREASE
580	595 INCREASE
595	602 INCREASE
602	596
596	605 INCREASE
605	618 INCREASE
618	630 INCREASE
630	631 INCREASE
631	633 INCREASE
633	632
632	634 INCREASE
634	645 INCREASE
645	657 INCREASE
657	673 INCREASE
673	693 INCREASE
693	694 INCREASE
694	705 INCREASE
705	721 INCREASE
721	722 INCREASE
722	743 INCREASE
743	744 INCREASE
744	753 INCREASE
753	754 INCREASE
754	755 INCREASE
755	756 INCREASE
756	757 INCREASE
757	772 INCREASE
772	775 INCREASE
775	812 INCREASE
812	801
801	811 INCREASE
811	812 INCREASE
812	813 INCREASE
813	816 INCREASE
816	806
806	807 INCREASE
807	808 INCREASE
808	825 INCREASE
825	837 INCREASE
837	838 INCREASE
838	833
833	825
825	827 INCREASE
827	826
826	818
818	808
808	825 INCREASE
825	828 INCREASE
828	834 INCREASE
834	836 INCREASE
836	839 INCREASE
839	859 INCREASE
859	879 INCREASE
879	870
870	875 INCREASE
875	886 INCREASE
886	889 INCREASE
889	894 INCREASE
894	897 INCREASE
897	898 INCREASE
898	901 INCREASE
901	904 INCREASE
904	942 INCREASE
942	955 INCREASE
955	965 INCREASE
965	983 INCREASE
983	982
982	984 INCREASE
984	985 INCREASE
985	987 INCREASE
987	984
984	1005 INCREASE
1005	1012 INCREASE
1012	1024 INCREASE
1024	1033 INCREASE
1033	1036 INCREASE
1036	1048 INCREASE
1048	1052 INCREASE
1052	1058 INCREASE
1058	1070 INCREASE
1070	1078 INCREASE
1078	1080 INCREASE
1080	1079
1079	1094 INCREASE
1094	1102 INCREASE
1102	1104 INCREASE
1104	1110 INCREASE
1110	1122 INCREASE
1122	1117
1117	1118 INCREASE
1118	1107
1107	1108 INCREASE
1108	1118 INCREASE
1118	1133 INCREASE
1133	1138 INCREASE
1138	1165 INCREASE
1165	1167 INCREASE
1167	1172 INCREASE
1172	1169
1169	1179 INCREASE
1179	1193 INCREASE
1193	1157
1157	1164 INCREASE
1164	1165 INCREASE
1165	1167 INCREASE
1167	1170 INCREASE
1170	1178 INCREASE
1178	1179 INCREASE
1179	1180 INCREASE
1180	1188 INCREASE
1188	1187
1187	1188 INCREASE
1188	1202 INCREASE
1202	1201
1201	1200
1200	1206 INCREASE
1206	1213 INCREASE
1213	1214 INCREASE
1214	1213
1213	1219 INCREASE
1219	1220 INCREASE
1220	1223 INCREASE
1223	1233 INCREASE
1233	1235 INCREASE
1235	1237 INCREASE
1237	1245 INCREASE
1245	1246 INCREASE
1246	1250 INCREASE
1250	1251 INCREASE
1251	1256 INCREASE
1256	1263 INCREASE
1263	1268 INCREASE
1268	1271 INCREASE
1271	1294 INCREASE
1294	1295 INCREASE
1295	1308 INCREASE
1308	1311 INCREASE
1311	1314 INCREASE
1314	1317 INCREASE
1317	1321 INCREASE
1321	1332 INCREASE
1332	1336 INCREASE
1336	1337 INCREASE
1337	1327
1327	1330 INCREASE
1330	1310
1310	1319 INCREASE
1319	1323 INCREASE
1323	1325 INCREASE
1325	1356 INCREASE
1356	1353
1353	1370 INCREASE
1370	1372 INCREASE
1372	1397 INCREASE
1397	1410 INCREASE
1410	1413 INCREASE
1413	1425 INCREASE
1425	1428 INCREASE
1428	1432 INCREASE
1432	1440 INCREASE
1440	1443 INCREASE
1443	1452 INCREASE
1452	1451
1451	1455 INCREASE
1455	1456 INCREASE
1456	1457 INCREASE
1457	1461 INCREASE
1461	1462 INCREASE
1462	1463 INCREASE
1463	1464 INCREASE
1464	1456
1456	1467 INCREASE
1467	1470 INCREASE
1470	1471 INCREASE
1471	1474 INCREASE
1474	1492 INCREASE
1492	1478
1478	1492 INCREASE
1492	1498 INCREASE
1498	1508 INCREASE
1508	1516 INCREASE
1516	1515
1515	1516 INCREASE
1516	1519 INCREASE
1519	1520 INCREASE
1520	1509
1509	1510 INCREASE
1510	1521 INCREASE
1521	1526 INCREASE
1526	1528 INCREASE
1528	1533 INCREASE
1533	1536 INCREASE
1536	1547 INCREASE
1547	1560 INCREASE
1560	1571 INCREASE
1571	1589 INCREASE
1589	1586
1586	1589 INCREASE
1589	1591 INCREASE
1591	1597 INCREASE
1597	1598 INCREASE
1598	1605 INCREASE
1605	1613 INCREASE
1613	1615 INCREASE
1615	1617 INCREASE
1617	1618 INCREASE
1618	1642 INCREASE
1642	1632
1632	1628
1628	1638 INCREASE
1638	1641 INCREASE
1641	1640
1640	1657 INCREASE
1657	1669 INCREASE
1669	1675 INCREASE
1675	1690 INCREASE
1690	1714 INCREASE
1714	1715 INCREASE
1715	1716 INCREASE
1716	1715
1715	1717 INCREASE
1717	1740 INCREASE
1740	1741 INCREASE
1741	1743 INCREASE
1743	1741
1741	1746 INCREASE
1746	1759 INCREASE
1759	1766 INCREASE
1766	1772 INCREASE
1772	1773 INCREASE
1773	1792 INCREASE
1792	1793 INCREASE
1793	1795 INCREASE
1795	1827 INCREASE
1827	1832 INCREASE
1832	1833 INCREASE
1833	1834 INCREASE
1834	1846 INCREASE
1846	1867 INCREASE
1867	1868 INCREASE
1868	1872 INCREASE
1872	1877 INCREASE
1877	1878 INCREASE
1878	1876
1876	1878 INCREASE
1878	1881 INCREASE
1881	1883 INCREASE
1883	1886 INCREASE
1886	1904 INCREASE
1904	1920 INCREASE
1920	1921 INCREASE
1921	1924 INCREASE
1924	1929 INCREASE
1929	1955 INCREASE
1955	1956 INCREASE
1956	1961 INCREASE
1961	1962 INCREASE
1962	1968 INCREASE
1968	1971 INCREASE
1971	1968
1968	1955
1955	1973 INCREASE
1973	1974 INCREASE
1974	1991 INCREASE
1991	1984
1984	1989 INCREASE
1989	1990 INCREASE
1990	1987
1987	1991 INCREASE
1991	1998 INCREASE
1998	2002 INCREASE
2002	2005 INCREASE
2005	1989
1989	1986
1986	1985
1985	1987 INCREASE
1987	1991 INCREASE
1991	2011 INCREASE
2011	2014 INCREASE
2014	2019 INCREASE
2019	2021 INCREASE
2021	2022 INCREASE
2022	2033 INCREASE
2033	2039 INCREASE
2039	2044 INCREASE
2044	2046 INCREASE
2046	2045
2045	2056 INCREASE
2056	2060 INCREASE
2060	2062 INCREASE
2062	2058
2058	2063 INCREASE
2063	2072 INCREASE
2072	2073 INCREASE
2073	2075 INCREASE
2075	2100 INCREASE
2100	2124 INCREASE
2124	2131 INCREASE
2131	2143 INCREASE
2143	2145 INCREASE
2145	2153 INCREASE
2153	2155 INCREASE
2155	2154
2154	2156 INCREASE
2156	2157 INCREASE
2157	2158 INCREASE
2158	2174 INCREASE
2174	2197 INCREASE
2197	2187
2187	2188 INCREASE
2188	2192 INCREASE
2192	2194 INCREASE
2194	2195 INCREASE
2195	2205 INCREASE
2205	2206 INCREASE
2206	2208 INCREASE
2208	2210 INCREASE
2210	2211 INCREASE
2211	2222 INCREASE
2222	2227 INCREASE
2227	2229 INCREASE
2229	2230 INCREASE
2230	2240 INCREASE
2240	2245 INCREASE
2245	2246 INCREASE
2246	2243
2243	2244 INCREASE
2244	2261 INCREASE
2261	2262 INCREASE
2262	2263 INCREASE
2263	2258
2258	2261 INCREASE
2261	2263 INCREASE
2263	2284 INCREASE
2284	2294 INCREASE
2294	2295 INCREASE
2295	2294
2294	2289
2289	2290 INCREASE
2290	2293 INCREASE
2293	2294 INCREASE
2294	2295 INCREASE
2295	2290
2290	2319 INCREASE
2319	2323 INCREASE
2323	2324 INCREASE
2324	2332 INCREASE
2332	2336 INCREASE
2336	2340 INCREASE
2340	2373 INCREASE
2373	2374 INCREASE
2374	2375 INCREASE
2375	2377 INCREASE
2377	2408 INCREASE
2408	2417 INCREASE
2417	2422 INCREASE
2422	2442 INCREASE
2442	2443 INCREASE
2443	2444 INCREASE
2444	2447 INCREASE
2447	2448 INCREASE
2448	2465 INCREASE
2465	2467 INCREASE
2467	2468 INCREASE
2468	2485 INCREASE
2485	2486 INCREASE
2486	2489 INCREASE
2489	2504 INCREASE
2504	2505 INCREASE
2505	2506 INCREASE
2506	2529 INCREASE
2529	2530 INCREASE
2530	2531 INCREASE
2531	2557 INCREASE
2557	2563 INCREASE
2563	2579 INCREASE
2579	2582 INCREASE
2582	2583 INCREASE
2583	2595 INCREASE
2595	2629 INCREASE
2629	2634 INCREASE
2634	2638 INCREASE
2638	2635
2635	2640 INCREASE
2640	2643 INCREASE
2643	2653 INCREASE
2653	2658 INCREASE
2658	2656
2656	2657 INCREASE
2657	2658 INCREASE
2658	2660 INCREASE
2660	2662 INCREASE
2662	2670 INCREASE
2670	2679 INCREASE
2679	2672
2672	2685 INCREASE
2685	2688 INCREASE
2688	2699 INCREASE
2699	2695
2695	2696 INCREASE
2696	2714 INCREASE
2714	2698
2698	2702 INCREASE
2702	2703 INCREASE
2703	2707 INCREASE
2707	2711 INCREASE
2711	2718 INCREASE
2718	2719 INCREASE
2719	2727 INCREASE
2727	2742 INCREASE
2742	2758 INCREASE
2758	2759 INCREASE
2759	2768 INCREASE
2768	2769 INCREASE
2769	2773 INCREASE
2773	2787 INCREASE
2787	2801 INCREASE
2801	2810 INCREASE
2810	2811 INCREASE
2811	2805
2805	2806 INCREASE
2806	2811 INCREASE
2811	2812 INCREASE
2812	2815 INCREASE
2815	2848 INCREASE
2848	2850 INCREASE
2850	2856 INCREASE
2856	2845
2845	2855 INCREASE
2855	2866 INCREASE
2866	2874 INCREASE
2874	2885 INCREASE
2885	2887 INCREASE
2887	2877
2877	2878 INCREASE
2878	2879 INCREASE
2879	2880 INCREASE
2880	2887 INCREASE
2887	2888 INCREASE
2888	2892 INCREASE
2892	2899 INCREASE
2899	2900 INCREASE
2900	2891
2891	2901 INCREASE
2901	2900
2900	2876
2876	2885 INCREASE
2885	2893 INCREASE
2893	2921 INCREASE
2921	2923 INCREASE
2923	2925 INCREASE
2925	2940 INCREASE
2940	2945 INCREASE
2945	2947 INCREASE
2947	2950 INCREASE
2950	2944
2944	2947 INCREASE
2947	2949 INCREASE
2949	2950 INCREASE
2950	2958 INCREASE
2958	2959 INCREASE
2959	2961 INCREASE
2961	2957
2957	2958 INCREASE
2958	2959 INCREASE
2959	2963 INCREASE
2963	2959
2959	2966 INCREASE
2966	2976 INCREASE
2976	2985 INCREASE
2985	2986 INCREASE
2986	2987 INCREASE
2987	2993 INCREASE
2993	2994 INCREASE
2994	3005 INCREASE
3005	3008 INCREASE
3008	3010 INCREASE
3010	3011 INCREASE
3011	3028 INCREASE
3028	3032 INCREASE
3032	3035 INCREASE
3035	3036 INCREASE
3036	3059 INCREASE
3059	3060 INCREASE
3060	3061 INCREASE
3061	3060
3060	3065 INCREASE
3065	3069 INCREASE
3069	3115 INCREASE
3115	3123 INCREASE
3123	3129 INCREASE
3129	3130 INCREASE
3130	3128
3128	3126
3126	3123
3123	3124 INCREASE
3124	3120
3120	3124 INCREASE
3124	3134 INCREASE
3134	3138 INCREASE
3138	3143 INCREASE
3143	3145 INCREASE
3145	3149 INCREASE
3149	3188 INCREASE
3188	3196 INCREASE
3196	3203 INCREASE
3203	3201
3201	3203 INCREASE
3203	3204 INCREASE
3204	3206 INCREASE
3206	3208 INCREASE
3208	3214 INCREASE
3214	3201
3201	3220 INCREASE
3220	3236 INCREASE
3236	3237 INCREASE
3237	3259 INCREASE
3259	3260 INCREASE
3260	3274 INCREASE
3274	3276 INCREASE
3276	3283 INCREASE
3283	3280
3280	3282 INCREASE
3282	3301 INCREASE
3301	3313 INCREASE
3313	3319 INCREASE
3319	3326 INCREASE
3326	3338 INCREASE
3338	3339 INCREASE
3339	3341 INCREASE
3341	3345 INCREASE
3345	3331
3331	3335 INCREASE
3335	3363 INCREASE
3363	3364 INCREASE
3364	3369 INCREASE
3369	3364
3364	3371 INCREASE
3371	3370
3370	3388 INCREASE
3388	3390 INCREASE
3390	3398 INCREASE
3398	3399 INCREASE
3399	3398
3398	3387
3387	3394 INCREASE
3394	3395 INCREASE
3395	3396 INCREASE
3396	3404 INCREASE
3404	3408 INCREASE
3408	3416 INCREASE
3416	3414
3414	3437 INCREASE
3437	3451 INCREASE
3451	3453 INCREASE
3453	3455 INCREASE
3455	3477 INCREASE
3477	3481 INCREASE
3481	3482 INCREASE
3482	3489 INCREASE
3489	3488
3488	3486
3486	3501 INCREASE
3501	3510 INCREASE
3510	3520 INCREASE
3520	3538 INCREASE
3538	3561 INCREASE
3561	3564 INCREASE
3564	3570 INCREASE
3570	3583 INCREASE
3583	3563
3563	3565 INCREASE
3565	3566 INCREASE
3566	3567 INCREASE
3567	3569 INCREASE
3569	3573 INCREASE
3573	3575 INCREASE
3575	3576 INCREASE
3576	3584 INCREASE
3584	3593 INCREASE
3593	3569
3569	3585 INCREASE
3585	3586 INCREASE
3586	3585
3585	3591 INCREASE
3591	3593 INCREASE
3593	3596 INCREASE
3596	3597 INCREASE
3597	3592
3592	3611 INCREASE
3611	3614 INCREASE
3614	3620 INCREASE
3620	3621 INCREASE
3621	3637 INCREASE
3637	3641 INCREASE
3641	3642 INCREASE
3642	3648 INCREASE
3648	3660 INCREASE
3660	3667 INCREASE
3667	3664
3664	3678 INCREASE
3678	3687 INCREASE
3687	3703 INCREASE
3703	3715 INCREASE
3715	3725 INCREASE
3725	3730 INCREASE
3730	3731 INCREASE
3731	3738 INCREASE
3738	3739 INCREASE
3739	3740 INCREASE
3740	3754 INCREASE
3754	3756 INCREASE
3756	3760 INCREASE
3760	3768 INCREASE
3768	3772 INCREASE
3772	3775 INCREASE
3775	3779 INCREASE
3779	3809 INCREASE
3809	3816 INCREASE
3816	3806
3806	3807 INCREASE
3807	3806
3806	3811 INCREASE
3811	3813 INCREASE
3813	3820 INCREASE
3820	3819
3819	3820 INCREASE
3820	3822 INCREASE
3822	3827 INCREASE
3827	3828 INCREASE
3828	3826
3826	3836 INCREASE
3836	3837 INCREASE
3837	3838 INCREASE
3838	3832
3832	3833 INCREASE
3833	3835 INCREASE
3835	3836 INCREASE
3836	3839 INCREASE
3839	3849 INCREASE
3849	3853 INCREASE
3853	3854 INCREASE
3854	3862 INCREASE
3862	3868 INCREASE
3868	3871 INCREASE
3871	3872 INCREASE
3872	3877 INCREASE
3877	3878 INCREASE
3878	3881 INCREASE
3881	3910 INCREASE
3910	3911 INCREASE
3911	3912 INCREASE
3912	3913 INCREASE
3913	3925 INCREASE
3925	3926 INCREASE
3926	3958 INCREASE
3958	3961 INCREASE
3961	3964 INCREASE
3964	3977 INCREASE
3977	3995 INCREASE
3995	4001 INCREASE
4001	3997
3997	3981
3981	3960
3960	3961 INCREASE
3961	3954
3954	3964 INCREASE
3964	3963
3963	3968 INCREASE
3968	3964
3964	3965 INCREASE
3965	3980 INCREASE
3980	3984 INCREASE
3984	3985 INCREASE
3985	3986 INCREASE
3986	3991 INCREASE
3991	3998 INCREASE
3998	4008 INCREASE
4008	4015 INCREASE
4015	4019 INCREASE
4019	4020 INCREASE
4020	4023 INCREASE
4023	4040 INCREASE
4040	4055 INCREASE
4055	4061 INCREASE
4061	4064 INCREASE
4064	4074 INCREASE
4074	4078 INCREASE
4078	4079 INCREASE
4079	4078
4078	4086 INCREASE
4086	4101 INCREASE
4101	4102 INCREASE
4102	4104 INCREASE
4104	4106 INCREASE
4106	4109 INCREASE
4109	4107
4107	4113 INCREASE
4113	4112
4112	4120 INCREASE
4120	4108
4108	4116 INCREASE
4116	4118 INCREASE
4118	4119 INCREASE
4119	4130 INCREASE
4130	4123
4123	4135 INCREASE
4135	4132
4132	4133 INCREASE
4133	4136 INCREASE
4136	4109
4109	4088
4088	4090 INCREASE
4090	4091 INCREASE
4091	4092 INCREASE
4092	4094 INCREASE
4094	4099 INCREASE
4099	4102 INCREASE
4102	4113 INCREASE
4113	4131 INCREASE
4131	4130
4130	4151 INCREASE
4151	4152 INCREASE
4152	4153 INCREASE
4153	4157 INCREASE
4157	4161 INCREASE
4161	4180 INCREASE
4180	4182 INCREASE
4182	4186 INCREASE
4186	4192 INCREASE
4192	4223 INCREASE
4223	4218
4218	4219 INCREASE
4219	4220 INCREASE
4220	4246 INCREASE
4246	4255 INCREASE
4255	4259 INCREASE
4259	4257
4257	4258 INCREASE
4258	4274 INCREASE
4274	4293 INCREASE
4293	4294 INCREASE
4294	4303 INCREASE
4303	4305 INCREASE
4305	4316 INCREASE
4316	4314
4314	4315 INCREASE
4315	4324 INCREASE
4324	4330 INCREASE
4330	4317
4317	4318 INCREASE
4318	4331 INCREASE
4331	4332 INCREASE
4332	4376 INCREASE
4376	4379 INCREASE
4379	4388 INCREASE
4388	4396 INCREASE
4396	4399 INCREASE
4399	4403 INCREASE
4403	4405 INCREASE
4405	4401
4401	4409 INCREASE
4409	4415 INCREASE
4415	4419 INCREASE
4419	4421 INCREASE
4421	4427 INCREASE
4427	4428 INCREASE
4428	4446 INCREASE
4446	4447 INCREASE
4447	4448 INCREASE
4448	4456 INCREASE
4456	4467 INCREASE
4467	4483 INCREASE
4483	4484 INCREASE
4484	4486 INCREASE
4486	4495 INCREASE
4495	4496 INCREASE
4496	4503 INCREASE
4503	4516 INCREASE
4516	4517 INCREASE
4517	4521 INCREASE
4521	4523 INCREASE
4523	4532 INCREASE
4532	4536 INCREASE
4536	4555 INCREASE
4555	4557 INCREASE
4557	4563 INCREASE
4563	4564 INCREASE
4564	4565 INCREASE
4565	4577 INCREASE
4577	4579 INCREASE
4579	4576
4576	4577 INCREASE
4577	4581 INCREASE
4581	4598 INCREASE
4598	4600 INCREASE
4600	4620 INCREASE
4620	4623 INCREASE
4623	4624 INCREASE
4624	4627 INCREASE
4627	4630 INCREASE
4630	4645 INCREASE
4645	4646 INCREASE
4646	4658 INCREASE
4658	4668 INCREASE
4668	4671 INCREASE
4671	4682 INCREASE
4682	4665
4665	4702 INCREASE
4702	4701
4701	4705 INCREASE
4705	4712 INCREASE
4712	4716 INCREASE
4716	4715
4715	4716 INCREASE
4716	4720 INCREASE
4720	4726 INCREASE
4726	4741 INCREASE
4741	4760 INCREASE
4760	4765 INCREASE
4765	4760
4760	4761 INCREASE
4761	4764 INCREASE
4764	4755
4755	4756 INCREASE
4756	4757 INCREASE
4757	4758 INCREASE
4758	4759 INCREASE
4759	4761 INCREASE
4761	4767 INCREASE
4767	4768 INCREASE
4768	4769 INCREASE
4769	4776 INCREASE
4776	4774
4774	4775 INCREASE
4775	4780 INCREASE
4780	4782 INCREASE
4782	4780
4780	4781 INCREASE
4781	4782 INCREASE
4782	4785 INCREASE
4785	4795 INCREASE
4795	4788
4788	4793 INCREASE
4793	4800 INCREASE
4800	4812 INCREASE
4812	4830 INCREASE
4830	4832 INCREASE
4832	4831
4831	4832 INCREASE
4832	4833 INCREASE
4833	4846 INCREASE
4846	4849 INCREASE
4849	4845
4845	4849 INCREASE
4849	4853 INCREASE
4853	4866 INCREASE
4866	4870 INCREASE
4870	4898 INCREASE
4898	4900 INCREASE
4900	4904 INCREASE
4904	4905 INCREASE
4905	4907 INCREASE
4907	4909 INCREASE
4909	4910 INCREASE
4910	4911 INCREASE
4911	4906
4906	4866
4866	4868 INCREASE
4868	4881 INCREASE
4881	4882 INCREASE
4882	4894 INCREASE
4894	4898 INCREASE
4898	4900 INCREASE
4900	4913 INCREASE
4913	4914 INCREASE
4914	4918 INCREASE
4918	4926 INCREASE
4926	4925
4925	4926 INCREASE
4926	4918
4918	4933 INCREASE
4933	4925
4925	4932 INCREASE
4932	4933 INCREASE
4933	4939 INCREASE
4939	4940 INCREASE
4940	4946 INCREASE
4946	4947 INCREASE
4947	4957 INCREASE
4957	4958 INCREASE
4958	4960 INCREASE
4960	4961 INCREASE
4961	4963 INCREASE
4963	4968 INCREASE
4968	4969 INCREASE
4969	4963
4963	4964 INCREASE
4964	4966 INCREASE
4966	4946
4946	4950 INCREASE
4950	4974 INCREASE
4974	4975 INCREASE
4975	4978 INCREASE
4978	4980 INCREASE
4980	4983 INCREASE
4983	4985 INCREASE
4985	5005 INCREASE
5005	4990
4990	5002 INCREASE
5002	5026 INCREASE
5026	5021
5021	5039 INCREASE
5039	5052 INCREASE
5052	5025
5025	5024
5024	5023
5023	5026 INCREASE
5026	5037 INCREASE
5037	5045 INCREASE
5045	5056 INCREASE
5056	5058 INCREASE
5058	5059 INCREASE
5059	5060 INCREASE
5060	5040
5040	5047 INCREASE
5047	5050 INCREASE
5050	5079 INCREASE
5079	5081 INCREASE
5081	5086 INCREASE
5086	5088 INCREASE
5088	5064
5064	5067 INCREASE
5067	5068 INCREASE
5068	5083 INCREASE
5083	5097 INCREASE
5097	5102 INCREASE
5102	5101
5101	5087
5087	5090 INCREASE
5090	5089
5089	5088
5088	5090 INCREASE
5090	5092 INCREASE
5092	5104 INCREASE
5104	5109 INCREASE
5109	5111 INCREASE
5111	5116 INCREASE
5116	5113
5113	5114 INCREASE
5114	5103
5103	5120 INCREASE
5120	5122 INCREASE
5122	5117
5117	5104
5104	5126 INCREASE
5126	5127 INCREASE
5127	5128 INCREASE
5128	5121
5121	5123 INCREASE
5123	5124 INCREASE
5124	5127 INCREASE
5127	5129 INCREASE
5129	5131 INCREASE
5131	5132 INCREASE
5132	5137 INCREASE
5137	5141 INCREASE
5141	5164 INCREASE
5164	5178 INCREASE
5178	5184 INCREASE
5184	5196 INCREASE
5196	5211 INCREASE
5211	5210
5210	5218 INCREASE
5218	5219 INCREASE
5219	5250 INCREASE
5250	5251 INCREASE
5251	5260 INCREASE
5260	5250
5250	5256 INCREASE
5256	5253
5253	5251
5251	5243
5243	5244 INCREASE
5244	5245 INCREASE
5245	5256 INCREASE
5256	5261 INCREASE
5261	5262 INCREASE
5262	5266 INCREASE
5266	5269 INCREASE
5269	5270 INCREASE
5270	5276 INCREASE
5276	5291 INCREASE
5291	5299 INCREASE
5299	5300 INCREASE
5300	5315 INCREASE
5315	5317 INCREASE
5317	5320 INCREASE
5320	5321 INCREASE
5321	5322 INCREASE
5322	5324 INCREASE
5324	5333 INCREASE
5333	5330
5330	5359 INCREASE
5359	5362 INCREASE
5362	5383 INCREASE
5383	5386 INCREASE
5386	5389 INCREASE
5389	5391 INCREASE
5391	5412 INCREASE
5412	5413 INCREASE
5413	5415 INCREASE
5415	5438 INCREASE
5438	5439 INCREASE
5439	5441 INCREASE
5441	5459 INCREASE
5459	5460 INCREASE
5460	5459
5459	5465 INCREASE
5465	5461
5461	5463 INCREASE
5463	5466 INCREASE
5466	5470 INCREASE
5470	5467
5467	5477 INCREASE
5477	5483 INCREASE
5483	5485 INCREASE
5485	5486 INCREASE
5486	5487 INCREASE
5487	5490 INCREASE
5490	5518 INCREASE
5518	5537 INCREASE
5537	5546 INCREASE
5546	5556 INCREASE
5556	5576 INCREASE
5576	5574
5574	5582 INCREASE
5582	5583 INCREASE
5583	5587 INCREASE
5587	5583
5583	5584 INCREASE
5584	5589 INCREASE
5589	5590 INCREASE
5590	5600 INCREASE
5600	5601 INCREASE
5601	5602 INCREASE
5602	5604 INCREASE
5604	5605 INCREASE
5605	5606 INCREASE
5606	5607 INCREASE
5607	5617 INCREASE
5617	5604
5604	5609 INCREASE
5609	5596
5596	5597 INCREASE
5597	5601 INCREASE
5601	5607 INCREASE
5607	5612 INCREASE
5612	5613 INCREASE
5613	5625 INCREASE
5625	5627 INCREASE
5627	5640 INCREASE
5640	5642 INCREASE
5642	5651 INCREASE
5651	5655 INCREASE
5655	5651
5651	5655 INCREASE
5655	5656 INCREASE
5656	5680 INCREASE
5680	5683 INCREASE
5683	5684 INCREASE
5684	5687 INCREASE
5687	5689 INCREASE
5689	5691 INCREASE
5691	5696 INCREASE
5696	5706 INCREASE
5706	5708 INCREASE
5708	5729 INCREASE
5729	5748 INCREASE
5748	5749 INCREASE
5749	5753 INCREASE
5753	5757 INCREASE
5757	5772 INCREASE
5772	5773 INCREASE
5773	5783 INCREASE
5783	5785 INCREASE
5785	5783
5783	5784 INCREASE
5784	5785 INCREASE
5785	5786 INCREASE
5786	5785
5785	5787 INCREASE
5787	5808 INCREASE
5808	5801
5801	5803 INCREASE
5803	5810 INCREASE
5810	5818 INCREASE
5818	5823 INCREASE
5823	5829 INCREASE
5829	5832 INCREASE
5832	5826
5826	5839 INCREASE
5839	5841 INCREASE
5841	5844 INCREASE
5844	5846 INCREASE
5846	5847 INCREASE
5847	5860 INCREASE
5860	5862 INCREASE
5862	5872 INCREASE
5872	5869
5869	5854
5854	5865 INCREASE
5865	5866 INCREASE
5866	5870 INCREASE
5870	5872 INCREASE
5872	5875 INCREASE
5875	5911 INCREASE
5911	5924 INCREASE
5924	5937 INCREASE
5937	5947 INCREASE
5947	5965 INCREASE
5965	5969 INCREASE
5969	5971 INCREASE
5971	5976 INCREASE
5976	5974
5974	5976 INCREASE
5976	5960
5960	5962 INCREASE
5962	5963 INCREASE
5963	5965 INCREASE
5965	5975 INCREASE
5975	5976 INCREASE
5976	5985 INCREASE
5985	5986 INCREASE
5986	5981
5981	5990 INCREASE
5990	5993 INCREASE
5993	5982
5982	5989 INCREASE
5989	5990 INCREASE
5990	5994 INCREASE
5994	6015 INCREASE
6015	6020 INCREASE
6020	6030 INCREASE
6030	6041 INCREASE
6041	6012
6012	6014 INCREASE
6014	6035 INCREASE
6035	6040 INCREASE
6040	6016
6016	6038 INCREASE
6038	6061 INCREASE
6061	6047
6047	6052 INCREASE
6052	6055 INCREASE
6055	6057 INCREASE
6057	6072 INCREASE
6072	6094 INCREASE
6094	6099 INCREASE
6099	6104 INCREASE
6104	6112 INCREASE
6112	6110
6110	6126 INCREASE
6126	6125
6125	6135 INCREASE
6135	6152 INCREASE
6152	6161 INCREASE
6161	6169 INCREASE
6169	6172 INCREASE
6172	6187 INCREASE
6187	6197 INCREASE
6197	6198 INCREASE
6198	6206 INCREASE
6206	6207 INCREASE
6207	6205
6205	6204
6204	6202
6202	6205 INCREASE
6205	6200
6200	6202 INCREASE
6202	6206 INCREASE
6206	6223 INCREASE
6223	6224 INCREASE
6224	6231 INCREASE
6231	6237 INCREASE
6237	6241 INCREASE
6241	6271 INCREASE
6271	6272 INCREASE
6272	6273 INCREASE
6273	6281 INCREASE
6281	6277
6277	6282 INCREASE
6282	6283 INCREASE
6283	6298 INCREASE
6298	6305 INCREASE
6305	6307 INCREASE
6307	6333 INCREASE
6333	6334 INCREASE
6334	6340 INCREASE
6340	6341 INCREASE
6341	6342 INCREASE
6342	6343 INCREASE
6343	6336
6336	6342 INCREASE
6342	6343 INCREASE
6343	6348 INCREASE
6348	6355 INCREASE
6355	6375 INCREASE
6375	6388 INCREASE
6388	6389 INCREASE
6389	6391 INCREASE
6391	6416 INCREASE
6416	6417 INCREASE
6417	6418 INCREASE
6418	6419 INCREASE
6419	6428 INCREASE
6428	6462 INCREASE
6462	6463 INCREASE
6463	6464 INCREASE
6464	6465 INCREASE
6465	6432
6432	6443 INCREASE
6443	6444 INCREASE
6444	6446 INCREASE
6446	6451 INCREASE
6451	6453 INCREASE
6453	6472 INCREASE
6472	6470
6470	6483 INCREASE
6483	6484 INCREASE
6484	6495 INCREASE
6495	6485
6485	6489 INCREASE
6489	6490 INCREASE
6490	6466
6466	6462
6462	6468 INCREASE
6468	6461
6461	6462 INCREASE
6462	6458
6458	6461 INCREASE
6461	6475 INCREASE
6475	6499 INCREASE
6499	6502 INCREASE
6502	6504 INCREASE
6504	6506 INCREASE
6506	6512 INCREASE
6512	6527 INCREASE
6527	6528 INCREASE
6528	6540 INCREASE
6540	6542 INCREASE
6542	6545 INCREASE
6545	6565 INCREASE
6565	6566 INCREASE
6566	6585 INCREASE
6585	6592 INCREASE
6592	6597 INCREASE
6597	6598 INCREASE
6598	6599 INCREASE
6599	6613 INCREASE
6613	6622 INCREASE
6622	6626 INCREASE
6626	6637 INCREASE
6637	6639 INCREASE
6639	6657 INCREASE
6657	6672 INCREASE
6672	6679 INCREASE
6679	6684 INCREASE
6684	6687 INCREASE
6687	6684
6684	6721 INCREASE
6721	6722 INCREASE
6722	6725 INCREASE
6725	6727 INCREASE
6727	6728 INCREASE
6728	6730 INCREASE
6730	6732 INCREASE
6732	6751 INCREASE
6751	6756 INCREASE
6756	6763 INCREASE
6763	6764 INCREASE
6764	6779 INCREASE
6779	6807 INCREASE
6807	6817 INCREASE
6817	6822 INCREASE
6822	6824 INCREASE
6824	6826 INCREASE
6826	6821
6821	6823 INCREASE
6823	6838 INCREASE
6838	6834
6834	6835 INCREASE
6835	6837 INCREASE
6837	6843 INCREASE
6843	6862 INCREASE
6862	6863 INCREASE
6863	6864 INCREASE
6864	6865 INCREASE
6865	6835
6835	6839 INCREASE
6839	6844 INCREASE
6844	6845 INCREASE
6845	6884 INCREASE
6884	6885 INCREASE
6885	6895 INCREASE
6895	6904 INCREASE
6904	6905 INCREASE
6905	6908 INCREASE
6908	6909 INCREASE
6909	6914 INCREASE
6914	6916 INCREASE
6916	6917 INCREASE
6917	6920 INCREASE
6920	6921 INCREASE
6921	6920
6920	6921 INCREASE
6921	6934 INCREASE
6934	6913
6913	6917 INCREASE
6917	6928 INCREASE
6928	6930 INCREASE
6930	6931 INCREASE
6931	6941 INCREASE
6941	6944 INCREASE
6944	6957 INCREASE
6957	6959 INCREASE
6959	6967 INCREASE
6967	6970 INCREASE
6970	6971 INCREASE
6971	6973 INCREASE
6973	6984 INCREASE
6984	6986 INCREASE
6986	6987 INCREASE
6987	6990 INCREASE
6990	6993 INCREASE
6993	6994 INCREASE
6994	7018 INCREASE
7018	7019 INCREASE
7019	7026 INCREASE
7026	7028 INCREASE
7028	7044 INCREASE
7044	7048 INCREASE
7048	7051 INCREASE
7051	7053 INCREASE
7053	7052
7052	7050
7050	7053 INCREASE
7053	7056 INCREASE
7056	7030
7030	7044 INCREASE
7044	7043
7043	7055 INCREASE
7055	7067 INCREASE
7067	7068 INCREASE
7068	7083 INCREASE
7083	7065
7065	7066 INCREASE
7066	7082 INCREASE
7082	7084 INCREASE
7084	7088 INCREASE
7088	7079
7079	7078
7078	7080 INCREASE
7080	7081 INCREASE
7081	7083 INCREASE
7083	7086 INCREASE
7086	7092 INCREASE
7092	7102 INCREASE
7102	7122 INCREASE
7122	7146 INCREASE
7146	7149 INCREASE
7149	7150 INCREASE
7150	7155 INCREASE
7155	7167 INCREASE
7167	7170 INCREASE
7170	7168
7168	7176 INCREASE
7176	7185 INCREASE
7185	7186 INCREASE
7186	7182
7182	7183 INCREASE
7183	7185 INCREASE
7185	7187 INCREASE
7187	7204 INCREASE
7204	7208 INCREASE
7208	7209 INCREASE
7209	7211 INCREASE
7211	7228 INCREASE
7228	7230 INCREASE
7230	7232 INCREASE
7232	7233 INCREASE
7233	7239 INCREASE
7239	7242 INCREASE
7242	7245 INCREASE
7245	7246 INCREASE
7246	7247 INCREASE
7247	7251 INCREASE
7251	7253 INCREASE
7253	7255 INCREASE
7255	7258 INCREASE
7258	7259 INCREASE
7259	7268 INCREASE
7268	7270 INCREASE
7270	7272 INCREASE
7272	7291 INCREASE
7291	7319 INCREASE
7319	7320 INCREASE
7320	7321 INCREASE
7321	7323 INCREASE
7323	7333 INCREASE
7333	7351 INCREASE
7351	7343
7343	7349 INCREASE
7349	7366 INCREASE
7366	7378 INCREASE
7378	7383 INCREASE
7383	7384 INCREASE
7384	7381
7381	7377
7377	7379 INCREASE
7379	7383 INCREASE
7383	7386 INCREASE
7386	7401 INCREASE
7401	7410 INCREASE
7410	7438 INCREASE
7438	7441 INCREASE
7441	7443 INCREASE
7443	7444 INCREASE
7444	7446 INCREASE
7446	7445
7445	7446 INCREASE
7446	7448 INCREASE
7448	7459 INCREASE
7459	7462 INCREASE
7462	7457
7457	7461 INCREASE
7461	7462 INCREASE
7462	7466 INCREASE
7466	7477 INCREASE
7477	7489 INCREASE
7489	7497 INCREASE
7497	7500 INCREASE
7500	7501 INCREASE
7501	7523 INCREASE
7523	7524 INCREASE
7524	7527 INCREASE
7527	7536 INCREASE
7536	7538 INCREASE
7538	7539 INCREASE
7539	7541 INCREASE
7541	7533
7533	7536 INCREASE
7536	7539 INCREASE
7539	7547 INCREASE
7547	7567 INCREASE
7567	7548
7548	7544
7544	7546 INCREASE
7546	7548 INCREASE
7548	7563 INCREASE
7563	7564 INCREASE
7564	7571 INCREASE
7571	7583 INCREASE
7583	7585 INCREASE
7585	7594 INCREASE
7594	7597 INCREASE
7597	7605 INCREASE
7605	7606 INCREASE
7606	7633 INCREASE
7633	7655 INCREASE
7655	7656 INCREASE
7656	7660 INCREASE
7660	7672 INCREASE
7672	7676 INCREASE
7676	7684 INCREASE
7684	7686 INCREASE
7686	7687 INCREASE
7687	7688 INCREASE
7688	7689 INCREASE
7689	7681
7681	7680
7680	7691 INCREASE
7691	7690
7690	7711 INCREASE
7711	7725 INCREASE
7725	7726 INCREASE
7726	7729 INCREASE
7729	7741 INCREASE
7741	7744 INCREASE
7744	7745 INCREASE
7745	7772 INCREASE
7772	7773 INCREASE
7773	7786 INCREASE
7786	7782
7782	7783 INCREASE
7783	7788 INCREASE
7788	7794 INCREASE
7794	7795 INCREASE
7795	7803 INCREASE
7803	7804 INCREASE
7804	7813 INCREASE
7813	7817 INCREASE
7817	7848 INCREASE
7848	7858 INCREASE
7858	7849
7849	7856 INCREASE
7856	7858 INCREASE
7858	7860 INCREASE
7860	7859
7859	7877 INCREASE
7877	7878 INCREASE
7878	7879 INCREASE
7879	7901 INCREASE
7901	7931 INCREASE
7931	7935 INCREASE
7935	7937 INCREASE
7937	7944 INCREASE
7944	7945 INCREASE
7945	7949 INCREASE
7949	7954 INCREASE
7954	7955 INCREASE
7955	7953
7953	7956 INCREASE
7956	7968 INCREASE
7968	7970 INCREASE
7970	7973 INCREASE
7973	7974 INCREASE
7974	7971
7971	7975 INCREASE
7975	7991 INCREASE
7991	7989
7989	7994 INCREASE
7994	7985
7985	7988 INCREASE
7988	8002 INCREASE
8002	8008 INCREASE
8008	8015 INCREASE
8015	8019 INCREASE
8019	8029 INCREASE
8029	8028
8028	8052 INCREASE
8052	8057 INCREASE
8057	8051
8051	8063 INCREASE
8063	8065 INCREASE
8065	8064
8064	8069 INCREASE
8069	8082 INCREASE
8082	8093 INCREASE
8093	8098 INCREASE
8098	8105 INCREASE
8105	8104
8104	8109 INCREASE
8109	8103
8103	8119 INCREASE
8119	8130 INCREASE
8130	8153 INCREASE
8153	8165 INCREASE
8165	8157
8157	8159 INCREASE
8159	8176 INCREASE
8176	8168
8168	8173 INCREASE
8173	8171
8171	8162
8162	8176 INCREASE
8176	8182 INCREASE
8182	8190 INCREASE
8190	8208 INCREASE
8208	8212 INCREASE
8212	8213 INCREASE
8213	8214 INCREASE
8214	8220 INCREASE
8220	8222 INCREASE
8222	8209
8209	8194
8194	8220 INCREASE
8220	8221 INCREASE
8221	8242 INCREASE
8242	8252 INCREASE
8252	8255 INCREASE
8255	8252
8252	8231
8231	8239 INCREASE
8239	8236
8236	8237 INCREASE
8237	8242 INCREASE
8242	8244 INCREASE
8244	8245 INCREASE
8245	8246 INCREASE
8246	8261 INCREASE
8261	8280 INCREASE
8280	8281 INCREASE
8281	8282 INCREASE
8282	8288 INCREASE
8288	8289 INCREASE
8289	8283
8283	8287 INCREASE
8287	8288 INCREASE
8288	8299 INCREASE
8299	8303 INCREASE
8303	8305 INCREASE
8305	8318 INCREASE
8318	8319 INCREASE
8319	8328 INCREASE
8328	8331 INCREASE
8331	8344 INCREASE
8344	8346 INCREASE
8346	8371 INCREASE
8371	8377 INCREASE
8377	8388 INCREASE
8388	8405 INCREASE
8405	8414 INCREASE
8414	8415 INCREASE
8415	8416 INCREASE
8416	8396
8396	8364
8364	8352
8352	8353 INCREASE
8353	8362 INCREASE
8362	8363 INCREASE
8363	8369 INCREASE
8369	8375 INCREASE
8375	8382 INCREASE
8382	8403 INCREASE
8403	8405 INCREASE
8405	8407 INCREASE
8407	8406
8406	8411 INCREASE
8411	8419 INCREASE
8419	8423 INCREASE
8423	8427 INCREASE
8427	8433 INCREASE
8433	8434 INCREASE
8434	8439 INCREASE
8439	8442 INCREASE
8442	8447 INCREASE
8447	8436
8436	8442 INCREASE
8442	8443 INCREASE
8443	8451 INCREASE
8451	8452 INCREASE
8452	8472 INCREASE
8472	8473 INCREASE
8473	8499 INCREASE
8499	8504 INCREASE
8504	8496
8496	8481
8481	8484 INCREASE
8484	8511 INCREASE
8511	8503
8503	8506 INCREASE
8506	8513 INCREASE
8513	8517 INCREASE
8517	8522 INCREASE
8522	8525 INCREASE
8525	8524
8524	8527 INCREASE
8527	8532 INCREASE
8532	8551 INCREASE
8551	8552 INCREASE
8552	8554 INCREASE
8554	8555 INCREASE
8555	8558 INCREASE
8558	8567 INCREASE
8567	8568 INCREASE
8568	8570 INCREASE
8570	8571 INCREASE
8571	8573 INCREASE
8573	8574 INCREASE
8574	8577 INCREASE
8577	8578 INCREASE
8578	8579 INCREASE
8579	8586 INCREASE
8586	8596 INCREASE
8596	8597 INCREASE
8597	8616 INCREASE
8616	8617 INCREASE
8617	8620 INCREASE
8620	8624 INCREASE
8624	8625 INCREASE
8625	8627 INCREASE
8627	8629 INCREASE
8629	8642 INCREASE
8642	8643 INCREASE
8643	8648 INCREASE
8648	8662 INCREASE
8662	8664 INCREASE
8664	8665 INCREASE
8665	8679 INCREASE
8679	8686 INCREASE
8686	8685
8685	8711 INCREASE
8711	8714 INCREASE
8714	8718 INCREASE
8718	8720 INCREASE
8720	8724 INCREASE
8724	8726 INCREASE
8726	8735 INCREASE
8735	8736 INCREASE
8736	8777 INCREASE
8777	8778 INCREASE
8778	8780 INCREASE
8780	8783 INCREASE
8783	8779
8779	8788 INCREASE
8788	8789 INCREASE
8789	8825 INCREASE
8825	8827 INCREASE
8827	8837 INCREASE
8837	8871 INCREASE
8871	8873 INCREASE
8873	8874 INCREASE
8874	8881 INCREASE
8881	8898 INCREASE
8898	8902 INCREASE
8902	8871
8871	8884 INCREASE
8884	8885 INCREASE
8885	8889 INCREASE
8889	8915 INCREASE
8915	8909
8909	8910 INCREASE
8910	8912 INCREASE
8912	8915 INCREASE
8915	8914
8914	8922 INCREASE
8922	8927 INCREASE
8927	8941 INCREASE
8941	8979 INCREASE
8979	8974
8974	8987 INCREASE
8987	8974
8974	8981 INCREASE
8981	8975
8975	9004 INCREASE
9004	9008 INCREASE
9008	9011 INCREASE
9011	9025 INCREASE
9025	9027 INCREASE
9027	9028 INCREASE
9028	9030 INCREASE
9030	9043 INCREASE
9043	9057 INCREASE
9057	9072 INCREASE
9072	9078 INCREASE
9078	9084 INCREASE
9084	9088 INCREASE
9088	9091 INCREASE
9091	9095 INCREASE
9095	9101 INCREASE
9101	9105 INCREASE
9105	9114 INCREASE
9114	9123 INCREASE
9123	9134 INCREASE
9134	9174 INCREASE
9174	9171
9171	9172 INCREASE
9172	9173 INCREASE
9173	9171
9171	9179 INCREASE
9179	9183 INCREASE
9183	9188 INCREASE
9188	9190 INCREASE
9190	9196 INCREASE
9196	9197 INCREASE
9197	9198 INCREASE
9198	9202 INCREASE
9202	9210 INCREASE
9210	9231 INCREASE
9231	9232 INCREASE
9232	9243 INCREASE
9243	9256 INCREASE
9256	9257 INCREASE
9257	9259 INCREASE
9259	9263 INCREASE
9263	9265 INCREASE
9265	9264
9264	9258
9258	9273 INCREASE
9273	9282 INCREASE
9282	9285 INCREASE
9285	9269
9269	9274 INCREASE
9274	9262
9262	9261
9261	9270 INCREASE
9270	9284 INCREASE
9284	9285 INCREASE
9285	9286 INCREASE
9286	9289 INCREASE
9289	9290 INCREASE
9290	9291 INCREASE
9291	9293 INCREASE
9293	9282
9282	9285 INCREASE
9285	9286 INCREASE
9286	9289 INCREASE
9289	9287
9287	9289 INCREASE
9289	9291 INCREASE
9291	9289
9289	9290 INCREASE
9290	9299 INCREASE
9299	9302 INCREASE
9302	9316 INCREASE
9316	9317 INCREASE
9317	9342 INCREASE
9342	9337
9337	9339 INCREASE
9339	9340 INCREASE
9340	9341 INCREASE
9341	9342 INCREASE
9342	9371 INCREASE
9371	9373 INCREASE
9373	9374 INCREASE
9374	9373
9373	9374 INCREASE
9374	9376 INCREASE
9376	9384 INCREASE
9384	9390 INCREASE
9390	9423 INCREASE
9423	9424 INCREASE
9424	9427 INCREASE
9427	9429 INCREASE
9429	9430 INCREASE
9430	9431 INCREASE
9431	9432 INCREASE
9432	9434 INCREASE
9434	9465 INCREASE
9465	9473 INCREASE
9473	9474 INCREASE
9474	9478 INCREASE
9478	9482 INCREASE
9482	9483 INCREASE
9483	9485 INCREASE
9485	9469
9469	9471 INCREASE
9471	9441
9441	9457 INCREASE
9457	9467 INCREASE
9467	9462
9462	9474 INCREASE
9474	9475 INCREASE
9475	9481 INCREASE
9481	9475
9475	9476 INCREASE
9476	9479 INCREASE
9479	9482 INCREASE
9482	9484 INCREASE
9484	9493 INCREASE
9493	9500 INCREASE
9500	9506 INCREASE
9506	9509 INCREASE
9509	9510 INCREASE
9510	9511 INCREASE
9511	9524 INCREASE
9524	9529 INCREASE
9529	9558 INCREASE
9558	9571 INCREASE
9571	9576 INCREASE
9576	9579 INCREASE
9579	9581 INCREASE
9581	9582 INCREASE
9582	9587 INCREASE
9587	9594 INCREASE
9594	9618 INCREASE
9618	9638 INCREASE
9638	9646 INCREASE
9646	9649 INCREASE
9649	9650 INCREASE
9650	9649
9649	9655 INCREASE
9655	9646
9646	9648 INCREASE
9648	9652 INCREASE
9652	9665 INCREASE
9665	9659
9659	9697 INCREASE
9697	9703 INCREASE
9703	9733 INCREASE
9733	9750 INCREASE
9750	9751 INCREASE
9751	9753 INCREASE
9753	9754 INCREASE
9754	9755 INCREASE
9755	9761 INCREASE
9761	9762 INCREASE
9762	9766 INCREASE
9766	9784 INCREASE
9784	9789 INCREASE
9789	9766
9766	9767 INCREASE
9767	9768 INCREASE
9768	9771 INCREASE
9771	9785 INCREASE
9785	9789 INCREASE
9789	9792 INCREASE
9792	9807 INCREASE
9807	9821 INCREASE
9821	9823 INCREASE
9823	9830 INCREASE
9830	9844 INCREASE
9844	9847 INCREASE
9847	9857 INCREASE
9857	9858 INCREASE
9858	9860 INCREASE
9860	9873 INCREASE
9873	9870
9870	9873 INCREASE
9873	9887 INCREASE
9887	9880
9880	9878
9878	9891 INCREASE
9891	9893 INCREASE
9893	9894 INCREASE
9894	9896 INCREASE
9896	9902 INCREASE
9902	9911 INCREASE
9911	9920 INCREASE
9920	9931 INCREASE
9931	9963 INCREASE
9963	9972 INCREASE
9972	9974 INCREASE
9974	9973
9973	9974 INCREASE
9974	9976 INCREASE
9976	9990 INCREASE
9990	9989
9989	9996 INCREASE
9996	9995
9995	10024 INCREASE
10024	10025 INCREASE
10025	10026 INCREASE
10026	10028 INCREASE
10028	10040 INCREASE
10040	10041 INCREASE
10041	10040
10040	10041 INCREASE
10041	10044 INCREASE
1715
#+end_example


** Scala

#+begin_src scala
  import scala.io.Source

  def increaseCount(filename: String) = {
    val bufferedSource = Source.fromFile(filename)

    val result =
      bufferedSource.getLines.
        map(_.toInt).
        sliding(2).
        foldLeft(0)((acc, pair) => {
          print(s"${pair(0)} ${pair(1)} ")

          if (pair(0) < pair(1)) {
            println("INCREASE")
            acc + 1
          }
          else {
            println
            acc
          }
        })

    bufferedSource.close
    result
  }

  println(increaseCount("input.txt"))
#+end_src

** Elixir
